# Домашнее задание 4

Максимальный балл за домашнюю работу 10.
Необходимо выполнять все задания в ноутбуке с помощью чистого SQL и SQLAlchemy ORM:
- осуществить подключение к БД
- каждое задание оформить в отдельной ячейке
- результат выполнения запросов записать в pandas dataframe

In [ ]:
!pip install psycopg2
!pip install sqlalchemy==1.4.0

In [2]:
import sqlalchemy
from sqlalchemy import create_engine
import psycopg2
import pandas as pd
pd.set_option('display.max_columns', None)
import warnings
warnings.filterwarnings('ignore')

In [6]:
connection = psycopg2.connect(
    host='ep-bitter-breeze-a2oczi1e.eu-central-1.aws.neon.tech',
    database='club',
    user='KotelnikovNA',
    password='9YRzhyH2txkK'
    )

In [4]:
dbschema='cd,public' # Searches left-to-right

engine = create_engine('postgresql://KotelnikovNA:9YRzhyH2txkK@ep-bitter-breeze-a2oczi1e.eu-central-1.aws.neon.tech/club?sslmode=require', connect_args={'options': '-csearch_path={}'.format(dbschema)})
engine.table_names()

['facilities', 'bookings', 'members']

In [24]:
from sqlalchemy.schema import MetaData

metadata_club = MetaData()
metadata_club.reflect(bind=engine);
for table_name in metadata_club.tables:
    print(table_name)

facilities
bookings
members

In [151]:
from sqlalchemy import Table
facilities = Table('facilities', metadata_club, autoload=True)
bookings = Table('bookings', metadata_club, autoload=True)
members = Table('members', metadata_club, autoload=True)
from sqlalchemy import select

## Задание 1 (1 балл)

Сформируйте упорядоченный список из первых 10 фамилий в таблице участников?  
Список не должен содержать дубликатов.

In [38]:
select_result = engine.execute('''
select distinct surname 
from club.cd.members m
order by surname
limit 10 ''').fetchall()
select_result=pd.DataFrame(select_result)
select_result

   surname
0    Bader
1    Baker
2   Boothe
3  Butters
4   Coplin
5  Crumpet
6     Dare
7  Farrell
8    GUEST
9  Genting

In [128]:
from sqlalchemy.sql import func
sql_query = select(members.c.surname.distinct()).\
            order_by(members.c.surname) .\
            limit(10)
            

print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT DISTINCT members.surname
FROM members ORDER BY members.surname
 LIMIT :param_1

   surname
0    Bader
1    Baker
2   Boothe
3  Butters
4   Coplin
5  Crumpet
6     Dare
7  Farrell
8    GUEST
9  Genting

## Задание 2  (1 балл)

Выведите имя и фамилию последнего зарегистрировавшегося участника, а также дату.

In [56]:
select_result = engine.execute('''
select firstname, surname, joindate
from club.cd.members m
order by joindate desc
limit 1
''').fetchall()
select_result=pd.DataFrame(select_result)
select_result

  firstname surname            joindate
0    Darren   Smith 2012-09-26 18:08:45

In [248]:
sql_query = select(members.c.firstname, members.c.surname, members.c.joindate).\
    order_by(desc(members.c.joindate)).\
    limit(1)
                
print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT members.firstname, members.surname, members.joindate
FROM members ORDER BY members.joindate DESC
 LIMIT :param_1

  firstname surname            joindate
0    Darren   Smith 2012-09-26 18:08:45

## Задание 3 (2 балла)

Составьте список времени начала бронирования теннисных кортов на дату "2012-09-21".  
В итоговой выборке верните список пар времени начала и названий объектов, упорядоченных по времени.

In [257]:
select_result = engine.execute(
    '''
select (to_char(b.starttime, 'HH24:MI:SS')) as time, f.name
from club.cd.bookings b 
join club.cd.facilities f 
on f.facid = b.facid
where ((to_char(b.starttime, 'DD.MM.YYYY')) = '21.09.2012') and (name like 'Tennis Court%%')
order by time''').fetchall()

select_result=pd.DataFrame(select_result)
select_result

        time            name
0   08:00:00  Tennis Court 1
1   08:00:00  Tennis Court 2
2   09:30:00  Tennis Court 1
3   10:00:00  Tennis Court 2
4   11:30:00  Tennis Court 2
5   12:00:00  Tennis Court 1
6   13:30:00  Tennis Court 1
7   14:00:00  Tennis Court 2
8   15:30:00  Tennis Court 1
9   16:00:00  Tennis Court 2
10  17:00:00  Tennis Court 1
11  18:00:00  Tennis Court 2

In [267]:
from sqlalchemy.sql import func
sql_query = select(func.to_char(bookings.c.starttime, 'hh24:mi:ss').label('time'), facilities.c.name).\
            select_from(bookings.join(facilities, bookings.c.facid  == facilities.c.facid)).\
    where((func.to_char(bookings.c.starttime, 'DD.MM.YYYY') == '21.09.2012')& (facilities.c.name.like('Tennis Court%%'))).\
    order_by(func.to_char(bookings.c.starttime, 'HH24:MM:SS'))
                
print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT to_char(bookings.starttime, :to_char_1) AS time, facilities.name
FROM bookings JOIN facilities ON bookings.facid = facilities.facid
WHERE to_char(bookings.starttime, :to_char_2) = :to_char_3 AND facilities.name LIKE :name_1 ORDER BY to_char(bookings.starttime, :to_char_4)

        time            name
0   08:00:00  Tennis Court 1
1   08:00:00  Tennis Court 2
2   09:30:00  Tennis Court 1
3   10:00:00  Tennis Court 2
4   11:30:00  Tennis Court 2
5   12:00:00  Tennis Court 1
6   13:30:00  Tennis Court 1
7   14:00:00  Tennis Court 2
8   15:30:00  Tennis Court 1
9   16:00:00  Tennis Court 2
10  17:00:00  Tennis Court 1
11  18:00:00  Tennis Court 2

## Задание 4 (2 балла)

 Выведите список всех участников, включая человека, который их рекомендовал (если таковой имеется).  
 Убедитесь, что результаты упорядочены по (фамилия, имя).

In [189]:
select_result = engine.execute(
    '''select m.firstname ||' '|| m.surname as FIO, m2.firstname||' '|| m2.surname as FIOrec
from club.cd.members m 
left join  club.cd.members m2
on m.recommendedby = m2.memid
order by FIO
''').fetchall()

select_result=pd.DataFrame(select_result)
select_result

                        fio             fiorec
0            Anna Mackenzie       Darren Smith
1                Anne Baker    Ponder Stibbons
2              Burton Tracy               None
3              Charles Owen       Darren Smith
4              Darren Smith               None
5              Darren Smith               None
6             David Farrell               None
7               David Jones    Janice Joplette
8              David Pinker     Jemima Farrell
9             Douglas Jones        David Jones
10            Erica Crumpet        Tracy Smith
11           Florence Bader    Ponder Stibbons
12              GUEST GUEST               None
13           Gerald Butters       Darren Smith
14         Henrietta Rumney    Matthew Genting
15  Henry Worthington-Smyth        Tracy Smith
16      Hyacinth Tupperware               None
17               Jack Smith       Darren Smith
18          Janice Joplette       Darren Smith
19           Jemima Farrell               None
20              Joan Coplin      Timothy Baker
21                John Hunt  Millicent Purview
22          Matthew Genting     Gerald Butters
23        Millicent Purview        Tracy Smith
24               Nancy Dare    Janice Joplette
25          Ponder Stibbons       Burton Tracy
26         Ramnaresh Sarwin     Florence Bader
27               Tim Boothe         Tim Rownam
28               Tim Rownam               None
29            Timothy Baker     Jemima Farrell
30              Tracy Smith               None

In [217]:
from sqlalchemy.orm import aliased 
m1 = aliased(members)
m2 = aliased(members)
m3=m1.join(m2, m1.c.recommendedby  == m2.c.memid,isouter=True)


sql_query = select((m1.c.firstname + ' ' + m1.c.surname).label('FIO'), (m2.c.firstname + ' ' + m2.c.surname).label('FIO_recommended')).\
            select_from(m3).\
    order_by ((m1.c.firstname + ' ' + m1.c.surname))
print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT members_1.firstname || :firstname_1 || members_1.surname AS "FIO", members_2.firstname || :firstname_2 || members_2.surname AS "FIO_recommended"
FROM members AS members_1 LEFT OUTER JOIN members AS members_2 ON members_1.recommendedby = members_2.memid ORDER BY members_1.firstname || :firstname_3 || members_1.surname

                        FIO    FIO_recommended
0            Anna Mackenzie       Darren Smith
1                Anne Baker    Ponder Stibbons
2              Burton Tracy               None
3              Charles Owen       Darren Smith
4              Darren Smith               None
5              Darren Smith               None
6             David Farrell               None
7               David Jones    Janice Joplette
8              David Pinker     Jemima Farrell
9             Douglas Jones        David Jones
10            Erica Crumpet        Tracy Smith
11           Florence Bader    Ponder Stibbons
12              GUEST GUEST               None
13           Gerald Butters       Darren Smith
14         Henrietta Rumney    Matthew Genting
15  Henry Worthington-Smyth        Tracy Smith
16      Hyacinth Tupperware               None
17               Jack Smith       Darren Smith
18          Janice Joplette       Darren Smith
19           Jemima Farrell               None
20              Joan Coplin      Timothy Baker
21                John Hunt  Millicent Purview
22          Matthew Genting     Gerald Butters
23        Millicent Purview        Tracy Smith
24               Nancy Dare    Janice Joplette
25          Ponder Stibbons       Burton Tracy
26         Ramnaresh Sarwin     Florence Bader
27               Tim Boothe         Tim Rownam
28               Tim Rownam               None
29            Timothy Baker     Jemima Farrell
30              Tracy Smith               None

## Задание 5 (2 балла)

Составьте список чила слотов забронированных по каждой услуге в сентябре 2012ого года.  

В выводе отобразите две колонки: `facid`, `Total Slots`, и отсортируйте по числу слотов.

In [168]:
select_result = engine.execute(
    '''
select facid, sum(slots) as summ_sl 
from club.cd.bookings b 
where ((to_char(b.starttime, 'MM.YYYY')) = '09.2012')
group by facid
order by summ_sl''').fetchall()

select_result=pd.DataFrame(select_result)
select_result

   facid  summ_sl
0      5      122
1      3      422
2      7      426
3      8      471
4      6      540
5      2      570
6      1      588
7      0      591
8      4      648

In [177]:
from sqlalchemy.sql import func
sql_query = select([bookings.c.facid, func.sum(bookings.c.slots).label('summ_sl')]).\
    where(func.to_char(bookings.c.starttime, 'MM.YYYY') == '09.2012').\
    group_by(bookings.c.facid).\
    order_by(func.sum(bookings.c.slots).label('summ_sl'))
          
                
print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT bookings.facid, sum(bookings.slots) AS summ_sl
FROM bookings
WHERE to_char(bookings.starttime, :to_char_1) = :to_char_2 GROUP BY bookings.facid ORDER BY sum(bookings.slots)

   facid  summ_sl
0      5      122
1      3      422
2      7      426
3      8      471
4      6      540
5      2      570
6      1      588
7      0      591
8      4      648

## Задание 6 (2 балла)

Составьте список бронирований на день 2012-09-14, которые обойдутся участнику (или гостю) более чем в 30 долларов. Помните, что у гостя всегда идентификатор 0 и расходы гостей отличаются от расходов участников (расходы указаны за получасовой слот).

В выводе отобразите три колонки: `member`, `facility`, `cost` и отсортируйте по убыванию стоимости. В колонке `member` объединим имя и фамилию следующим образом:

`mems.firstname || ' ' || mems.surname as member`  
(в данном случае `mems` — это алиас на колонку `members`)

In [197]:
select_result = engine.execute('''
select* 
from (select (m.firstname || ' ' || m.surname) as member, f.name as  facility,
(case 
when b.memid = 0 then b.slots * f.guestcost
when b.memid <> 0 then b.slots * f.membercost
end ) as cost
from club.cd.bookings b 
join club.cd.facilities f 
on b.facid=f.facid
join club.cd.members m 
on b.memid=m.memid
where ((to_char(b.starttime, 'DD.MM.YYYY')) = '14.09.2012')
) as foo
where cost > 30
order by cost desc''').fetchall()

select_result=pd.DataFrame(select_result)
select_result

             member        facility  cost
0       GUEST GUEST  Massage Room 2   320
1       GUEST GUEST  Massage Room 1   160
2       GUEST GUEST  Massage Room 1   160
3       GUEST GUEST  Massage Room 1   160
4       GUEST GUEST  Tennis Court 2   150
5    Jemima Farrell  Massage Room 1   140
6       GUEST GUEST  Tennis Court 1    75
7       GUEST GUEST  Tennis Court 1    75
8       GUEST GUEST  Tennis Court 2    75
9   Ponder Stibbons  Massage Room 1    70
10   Jemima Farrell  Massage Room 1    70
11     Burton Tracy  Massage Room 1    70
12  Matthew Genting  Massage Room 1    70
13   Florence Bader  Massage Room 2    70
14       Jack Smith  Massage Room 1    70
15      GUEST GUEST    Squash Court  70.0
16      GUEST GUEST    Squash Court  35.0
17      GUEST GUEST    Squash Court  35.0

In [245]:
from sqlalchemy import case
bf=bookings.join(facilities, bookings.c.facid  == facilities.c.facid)
bfm = bf.join(members, bookings.c.memid == members.c.memid)
expr = case(
    [
        (bookings.c.memid == 0 , bookings.c.slots * facilities.c.guestcost),
        (bookings.c.memid > 0 , bookings.c.slots * facilities.c.membercost)
    ],
    else_=0,
)
sql_query = select((members.c.firstname + ' ' + members.c.surname).label('member'), facilities.c.name.label('facility'), expr.label('cost')).\
    select_from(bfm).\
    where((func.to_char(bookings.c.starttime, 'DD.MM.YYYY') == '14.09.2012') & (expr > 30)).\
    order_by(desc(expr.label('cost')))


          
                
print(sql_query, '\n')
result = pd.DataFrame(engine.execute(sql_query))
result

SELECT members.firstname || :firstname_1 || members.surname AS member, facilities.name AS facility, CASE WHEN (bookings.memid = :memid_1) THEN bookings.slots * facilities.guestcost WHEN (bookings.memid > :memid_2) THEN bookings.slots * facilities.membercost ELSE :param_1 END AS cost
FROM bookings JOIN facilities ON bookings.facid = facilities.facid JOIN members ON bookings.memid = members.memid
WHERE to_char(bookings.starttime, :to_char_1) = :to_char_2 AND CASE WHEN (bookings.memid = :memid_1) THEN bookings.slots * facilities.guestcost WHEN (bookings.memid > :memid_2) THEN bookings.slots * facilities.membercost ELSE :param_1 END > :param_2 ORDER BY cost DESC

             member        facility  cost
0       GUEST GUEST  Massage Room 2   320
1       GUEST GUEST  Massage Room 1   160
2       GUEST GUEST  Massage Room 1   160
3       GUEST GUEST  Massage Room 1   160
4       GUEST GUEST  Tennis Court 2   150
5    Jemima Farrell  Massage Room 1   140
6       GUEST GUEST  Tennis Court 1    75
7       GUEST GUEST  Tennis Court 1    75
8       GUEST GUEST  Tennis Court 2    75
9   Ponder Stibbons  Massage Room 1    70
10   Jemima Farrell  Massage Room 1    70
11     Burton Tracy  Massage Room 1    70
12  Matthew Genting  Massage Room 1    70
13   Florence Bader  Massage Room 2    70
14       Jack Smith  Massage Room 1    70
15      GUEST GUEST    Squash Court  70.0
16      GUEST GUEST    Squash Court  35.0
17      GUEST GUEST    Squash Court  35.0